КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыПеревозки/КонтурЛогистика_ВидыПеревозки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_ВидыПеревозки</name>
  <enumValues>
    <name>КП</name>
  </enumValues>
  <enumValues>
    <name>СН</name>
  </enumValues>
  <enumValues>
    <name>СТ</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_ВидыПеревозки/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ЗначениеДляXDTO(Ссылка) Экспорт
	
	Если Ссылка= КП Тогда 
		Результат = "КП";
	ИначеЕсли Ссылка= СН Тогда 
		Результат = "СН";
	ИначеЕсли Ссылка= СТ Тогда 
		Результат = "СТ";
	Иначе
		
		ВызватьИсключение "Для заполнения в xml передано неверное значение Вида перевозки: " + Ссылка;
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеИзXDTO(Строка) Экспорт
	
	Если Строка= "КП" Тогда 
		Результат = КП;
	ИначеЕсли Строка= "СН" Тогда 
		Результат = СН;
	ИначеЕсли Строка= "СТ" Тогда 
		Результат = СТ;
	Иначе
		
		Результат = ПустаяСсылка();
	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецЕсли
